Returns a PatternTableIterator that iterates through the collection.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ExportPatternTableIterator GetPatternTableIterator()
  Visual Basic
Public Function GetPatternTableIterator As ExportPatternTableIterator
  Visual C++
public:
ExportPatternTableIterator^ GetPatternTableIterator()
 Return Value
 A PatternTableIterator object that can be used to iterate through key-value pairs in the collection.
 See Also
  ExportPatternTable Class
  Autodesk.Revit.DB Namespace